(* 練習問題 3.10 *)

(*
fib 4 の評価ステップ
テキスト内で冗長な呼び出しの多いパターンと,
fib_pair を局所定義するパターンがあったが, 
後者の局所定義の評価ステップの書き方がよくわからないので前者の方法で書く.

何を1ステップとするかは明言されていないので厳密さに欠けるかもしれない

(冗長なパターン)
fib 4
-> if 4 = 1 || 4 = 2 then 1 else fib(4 - 1) + fib(4 - 2)
-> fib(4 - 1) + fib(4 - 2)
-> fib(3) + fib(4 - 2)
-> (if 3 = 1 || 3 = 2 then 1 else fib(3 - 1) + fib(3 - 2)) + fib(4 - 2)
-> (fib(3 - 1) + fib(3 - 2)) + fib(4 - 2)
-> (fib(2) + fib(3 - 2)) + fib(4 - 2)
-> ((if 2 = 1 || 2 = 2 then 1 else fib(2 - 1) + fib(2 - 2)) + fib(3 - 2)) + fib(4 - 2)
-> (1 + fib(3 - 2)) + fib(4 - 2)
-> (1 + fib(1)) + fib(4 - 2)
-> (1 + if 1 = 1 || 1 = 2 then 1 else fib(1 - 1) + fib(1 - 2)) + fib(4 - 2)
-> (1 + 1) + fib(4 - 2)
-> 2 + fib(4 - 2)
-> 2 + fib(2)
-> 2 + if 2 = 1 || 2 = 2 then 1 else fib(2 - 1) + fib(2 - 2)
-> 2 + 1
-> 3

*)